{
  "format": "full",
  "dryRun": false,
  "assessments": [
    {
      "organisation": {
        "name": "Rediscovery Centre",
        "country": "Ireland",
        "region": "Dublin",
        "sector": "Circular Economy & Reuse",
        "size": "11-50 employees",
        "legalStructure": "CLG (Company Limited by Guarantee)"
      },
      "responses": [
        { "questionId": "gov-q1", "numericValue": 4 },
        { "questionId": "gov-q2", "numericValue": 4 },
        { "questionId": "gov-q3", "textValue": "The board meets quarterly with a mix of environmental experts, community representatives, and social enterprise practitioners. All strategic decisions are made collectively with published minutes and open feedback sessions." },
        { "questionId": "gov-q4", "textValue": "Our governance charter mandates that at least two board seats are reserved for community members from the Ballymun area, ensuring local voice in decisions affecting the neighbourhood." },
        { "questionId": "gov-q5", "textValue": "Annual governance review conducted with support from Social Enterprise Republic of Ireland (SERI), aligned with the Governance Code for Community & Voluntary organisations." },
        { "questionId": "sm-q1", "numericValue": 5 },
        { "questionId": "sm-q2", "numericValue": 4 },
        { "questionId": "sm-q3", "textValue": "Our core mission is to demonstrate that the circular economy can create meaningful employment pathways for people distanced from the labour market while diverting waste from landfill. We repair, reuse, and upcycle furniture, textiles, bicycles, and electronics." },
        { "questionId": "sm-q4", "textValue": "We track participant progression: 68% of our participants move into open employment or further education within 12 months of completing our programme." },
        { "questionId": "sm-q5", "textValue": "Aligned with Ireland's Whole of Government Circular Economy Strategy 2022-2023 and EU Circular Economy Action Plan. Recognised as a National Demonstration Centre for the circular economy." },
        { "questionId": "emp-q1", "numericValue": 4 },
        { "questionId": "emp-q2", "numericValue": 4 },
        { "questionId": "emp-q3", "textValue": "We offer 6-12 month supported employment placements across four workshops: furniture restoration, bicycle repair, textile upcycling, and electronics refurbishment. Each participant has an individual learning plan with dedicated mentors." },
        { "questionId": "emp-q4", "textValue": "Participants earn the national minimum wage from day one, with structured progression to higher rates. 22 participants currently employed, with 8 in supervisory training roles." },
        { "questionId": "emp-q5", "textValue": "FETAC/QQI Level 4-6 certifications available in waste management, retail skills, and environmental awareness. We partner with TU Dublin for accredited training modules." },
        { "questionId": "cul-q1", "numericValue": 4 },
        { "questionId": "cul-q2", "numericValue": 5 },
        { "questionId": "cul-q3", "textValue": "Monthly staff wellbeing check-ins, trauma-informed practice training for all staff, multilingual signage throughout the centre. We celebrate cultural diversity days quarterly with participants from 14 different nationalities." },
        { "questionId": "cul-q4", "textValue": "Participants co-design their workshop schedules and contribute to the centre's product catalogue. A participant advisory group meets monthly to provide feedback on working conditions and suggest improvements." },
        { "questionId": "cul-q5", "textValue": "Flexible scheduling accommodates childcare needs, religious observances, and medical appointments. We provide a quiet room, prayer space, and on-site counselling access." },
        { "questionId": "eco-q1", "numericValue": 3 },
        { "questionId": "eco-q2", "numericValue": 4 },
        { "questionId": "eco-q3", "textValue": "Revenue mix: 45% commercial sales (shop and online), 30% CE scheme funding, 15% grant income (Pobal, Dublin City Council), 10% training fees. We have grown commercial revenue by 20% year-on-year." },
        { "questionId": "eco-q4", "textValue": "3-year financial plan in place reviewed annually. Cash reserves of approximately 4 months operating costs. Working towards reducing dependency on CE scheme funding to below 25%." },
        { "questionId": "eco-q5", "textValue": "Social procurement contracts with Dublin City Council for furniture collection and refurbishment. Exploring partnerships with corporate clients for office furniture circular economy services." },
        { "questionId": "stk-q1", "numericValue": 4 },
        { "questionId": "stk-q2", "numericValue": 4 },
        { "questionId": "stk-q3", "textValue": "Active partnerships with 12 local employers who provide work placements, job shadowing, and direct hire pathways. Quarterly employer engagement breakfasts." },
        { "questionId": "stk-q4", "textValue": "Member of ISEN (Irish Social Enterprise Network), CRNI (Community Resources Network Ireland), and the European Reuse Network. Regular engagement with Department of Rural and Community Development." },
        { "questionId": "stk-q5", "textValue": "Strong relationship with Ballymun community through the Axis community centre, local schools partnerships, and a community repair cafe held monthly that serves 50+ residents." },
        { "questionId": "sup-q1", "numericValue": 3 },
        { "questionId": "sup-q2", "numericValue": 3 },
        { "questionId": "sup-q3", "textValue": "Each participant is assigned a key worker who provides weekly 1:1 support covering employment skills, personal development, housing, health, and financial literacy referrals." },
        { "questionId": "sup-q4", "textValue": "Referral pathways established with local ETBs, DEASP, Peter McVerry Trust, and Focus Ireland for housing support, and HSE addiction services. 90% of referrals made within 5 working days." },
        { "questionId": "sup-q5", "textValue": "We are developing a peer mentoring programme where graduated participants return to support new entrants. Currently 4 peer mentors in training." },
        { "questionId": "im-q1", "numericValue": 3 },
        { "questionId": "im-q2", "numericValue": 3 },
        { "questionId": "im-q3", "textValue": "Outcomes tracked quarterly: employment outcomes, qualification attainment, wellbeing surveys (WHO-5), waste diversion tonnage. Data entered into Salesforce CRM." },
        { "questionId": "im-q4", "textValue": "Annual impact report published and shared with funders, board, and community. Social Return on Investment (SROI) analysis conducted in 2024 showed a ratio of 1:4.2." },
        { "questionId": "im-q5", "textValue": "Participated in CRNI's national reuse impact measurement pilot. Working towards aligning with ENSIE Impact-WISEs framework for European comparability." },
        { "questionId": "env-q1", "numericValue": 5 },
        { "questionId": "env-q2", "numericValue": 4 },
        { "questionId": "env-q3", "textValue": "Core business IS circular economy — we diverted 380 tonnes from landfill last year. Solar panels installed on the centre roof, LED lighting throughout, electric cargo bike for local deliveries." },
        { "questionId": "env-q4", "textValue": "All participants receive environmental awareness training as part of induction. Green skills modules include waste auditing, energy efficiency, and sustainable materials knowledge." },
        { "questionId": "env-q5", "textValue": "Carbon footprint measured annually — reduced by 15% year-on-year. Working towards EPA green enterprise certification. Aligned with Dublin City Council Climate Action Plan 2024-2029." }
      ]
    },
    {
      "organisation": {
        "name": "WALK Supported Employment",
        "country": "Ireland",
        "region": "Dublin",
        "sector": "Social Care & Health",
        "size": "51-200 employees",
        "legalStructure": "CLG (Company Limited by Guarantee)"
      },
      "responses": [
        { "questionId": "gov-q1", "numericValue": 4 },
        { "questionId": "gov-q2", "numericValue": 5 },
        { "questionId": "gov-q3", "textValue": "Board of directors includes people with disabilities, family representatives, and sector experts. Annual AGM with full transparency of accounts and strategic plans. Compliant with Charities Regulator governance code." },
        { "questionId": "gov-q4", "textValue": "Service users elect two representatives to the board annually. A dedicated advocacy group 'WALK Leaders' feeds directly into strategic planning." },
        { "questionId": "gov-q5", "textValue": "Governance review completed by external auditor every 3 years. Currently aligned with the Charity Governance Code and progressing towards triple-lock compliance." },
        { "questionId": "sm-q1", "numericValue": 5 },
        { "questionId": "sm-q2", "numericValue": 5 },
        { "questionId": "sm-q3", "textValue": "Our mission is to support people with intellectual disabilities and autism to achieve their employment, education, and independent living goals. We believe in a person-centred, rights-based approach aligned with the UN Convention on the Rights of Persons with Disabilities." },
        { "questionId": "sm-q4", "textValue": "Over 350 participants across Dublin supported annually. 42% of participants in our supported employment programme secured paid employment in the open labour market in 2025." },
        { "questionId": "sm-q5", "textValue": "Aligned with the National Disability Inclusion Strategy, UNCRPD, and the Comprehensive Employment Strategy for People with Disabilities 2015-2024." },
        { "questionId": "emp-q1", "numericValue": 4 },
        { "questionId": "emp-q2", "numericValue": 4 },
        { "questionId": "emp-q3", "textValue": "Three-phase supported employment model: Assessment & Preparation (3 months), Placement & Support (6 months), Follow-Up & Progression (ongoing). Each participant has a personalised employment plan." },
        { "questionId": "emp-q4", "textValue": "Currently support 120 people in paid employment across retail, hospitality, administration, and warehousing. Employer partners include Dunnes Stores, Tesco, and numerous SMEs." },
        { "questionId": "emp-q5", "textValue": "QQI-accredited training in employment skills, digital literacy, communication, and independent living. Dedicated job coaches maintain an average caseload of 15 participants each." },
        { "questionId": "cul-q1", "numericValue": 5 },
        { "questionId": "cul-q2", "numericValue": 5 },
        { "questionId": "cul-q3", "textValue": "Rights-based culture embedded in every aspect. Staff trained in person-centred planning, positive behaviour support, and trauma-informed care. Regular 'Supported Self-Advocacy' workshops run by and for participants." },
        { "questionId": "cul-q4", "textValue": "Easy-read versions of all policies and documents. Participant-led newsletter published quarterly. Annual 'WALK Awards' celebration recognises participant and staff achievements." },
        { "questionId": "cul-q5", "textValue": "Flexible working arrangements for all staff. Mental health supports through Employee Assistance Programme. Staff retention rate of 87% over the past 3 years." },
        { "questionId": "eco-q1", "numericValue": 3 },
        { "questionId": "eco-q2", "numericValue": 3 },
        { "questionId": "eco-q3", "textValue": "Funding: 60% HSE Section 39 grants, 20% Department of Social Protection (EmployAbility), 12% fee-for-service contracts, 8% philanthropy and fundraising. Working to increase earned income." },
        { "questionId": "eco-q4", "textValue": "5-year strategic plan with financial sustainability pillar. Reserves policy maintains 3 months operational costs. Annual audit by independent auditors." },
        { "questionId": "eco-q5", "textValue": "Developing a social enterprise arm offering consultancy services to employers on disability inclusion, generating unrestricted revenue." },
        { "questionId": "stk-q1", "numericValue": 4 },
        { "questionId": "stk-q2", "numericValue": 4 },
        { "questionId": "stk-q3", "textValue": "Employer partnerships with over 80 businesses across Dublin. Regular employer workshops on disability awareness, workplace accommodations, and inclusive hiring practices." },
        { "questionId": "stk-q4", "textValue": "Active member of National Federation of Voluntary Service Providers, Disability Federation of Ireland, and European Association of Service Providers for Persons with Disabilities (EASPD)." },
        { "questionId": "stk-q5", "textValue": "Community integration programmes include sports clubs, arts groups, and volunteering opportunities. Strong relationship with Dublin City Council Disability Liaison team." },
        { "questionId": "sup-q1", "numericValue": 4 },
        { "questionId": "sup-q2", "numericValue": 4 },
        { "questionId": "sup-q3", "textValue": "Multidisciplinary support team includes social workers, occupational therapists, psychologists, speech and language therapists, and dedicated job coaches. Wraparound support for housing, transport, and health." },
        { "questionId": "sup-q4", "textValue": "Partnership with HSE disability services for clinical support. Referral networks with housing agencies, community mental health teams, and peer support organisations." },
        { "questionId": "sup-q5", "textValue": "Natural supports model — we train co-workers in partner businesses to provide ongoing day-to-day support, reducing dependency on formal support structures over time." },
        { "questionId": "im-q1", "numericValue": 3 },
        { "questionId": "im-q2", "numericValue": 4 },
        { "questionId": "im-q3", "textValue": "Person-centred outcomes tracked: employment outcomes, hours worked, skills gained, quality of life measures (POS), and participant satisfaction surveys administered biannually." },
        { "questionId": "im-q4", "textValue": "Annual outcomes report published on website. Quarterly data submissions to HSE. Participated in NDA national outcomes framework pilot." },
        { "questionId": "im-q5", "textValue": "Working towards implementing the Personal Outcomes Scale (POS) across all services. Training staff in outcomes-based accountability framework." },
        { "questionId": "env-q1", "numericValue": 2 },
        { "questionId": "env-q2", "numericValue": 3 },
        { "questionId": "env-q3", "textValue": "Green team established to reduce energy consumption across our 6 sites. Switching to hybrid fleet vehicles for community transport." },
        { "questionId": "env-q4", "textValue": "Environmental awareness module included in participant training. Supporting participants in eco-gardening project at our Walkinstown campus." },
        { "questionId": "env-q5", "textValue": "Developing a green procurement policy. Not yet measuring carbon footprint systematically but plan to start in 2027." }
      ]
    },
    {
      "organisation": {
        "name": "Rehab Enterprises",
        "country": "Ireland",
        "region": "Dublin",
        "sector": "Second-Hand & Social Retail",
        "size": "201-500 employees",
        "legalStructure": "CLG (Company Limited by Guarantee)"
      },
      "responses": [
        { "questionId": "gov-q1", "numericValue": 4 },
        { "questionId": "gov-q2", "numericValue": 4 },
        { "questionId": "gov-q3", "textValue": "Part of the Rehab Group with an independent subsidiary board. Governance compliant with Charities Regulator code. Board includes independent directors with retail, disability, and social enterprise expertise." },
        { "questionId": "gov-q4", "textValue": "Participant feedback mechanism through regional forums. Staff representatives attend quarterly board subcommittee meetings." },
        { "questionId": "gov-q5", "textValue": "External governance review every 2 years. Full compliance with Companies Act 2014 and Charities Act 2009 reporting requirements." },
        { "questionId": "sm-q1", "numericValue": 4 },
        { "questionId": "sm-q2", "numericValue": 4 },
        { "questionId": "sm-q3", "textValue": "Rehab Enterprises provides supported employment through a network of retail shops, recycling operations, and contract packaging services. Over 300 employees, with approximately 70% being people with disabilities." },
        { "questionId": "sm-q4", "textValue": "Annually, 85 participants transition from supported to mainstream employment. Our charity shops divert over 500 tonnes of textiles and household goods from landfill." },
        { "questionId": "sm-q5", "textValue": "Aligned with the Comprehensive Employment Strategy for People with Disabilities and Ireland's National Social Enterprise Policy 2019-2022 (now extended)." },
        { "questionId": "emp-q1", "numericValue": 3 },
        { "questionId": "emp-q2", "numericValue": 4 },
        { "questionId": "emp-q3", "textValue": "Structured supported employment across charity retail, recycling, and contract services. Employees receive the living wage, not just minimum wage. Training pathways from entry to supervisory roles." },
        { "questionId": "emp-q4", "textValue": "Currently employing 320 staff across 18 locations. 225 employees are people with disabilities in supported roles. Annual staff development budget of EUR 180,000." },
        { "questionId": "emp-q5", "textValue": "In-house training academy offering QQI certified programmes in retail, warehousing, and customer service. Partnership with SOLAS for apprenticeship pathways." },
        { "questionId": "cul-q1", "numericValue": 4 },
        { "questionId": "cul-q2", "numericValue": 4 },
        { "questionId": "cul-q3", "textValue": "Strong culture of inclusion with Disability Awareness Training mandatory for all staff. Employee engagement survey scores consistently above 78%. Peer support networks in each region." },
        { "questionId": "cul-q4", "textValue": "Annual staff awards programme. Social events calendar across all sites. Staff wellness programme including mental health first aid training." },
        { "questionId": "cul-q5", "textValue": "Reasonable accommodations process well-established with designated Access Officers in each region. Flexible working options including part-time, job-sharing, and adjusted hours." },
        { "questionId": "eco-q1", "numericValue": 3 },
        { "questionId": "eco-q2", "numericValue": 3 },
        { "questionId": "eco-q3", "textValue": "Revenue: 55% commercial trading income (retail sales, contracts), 35% HSE and DSP funding, 10% Rehab Group support. Commercial income growing at 8% annually." },
        { "questionId": "eco-q4", "textValue": "Break-even target for commercial operations by 2027. Working capital reserves of 4.5 months. Diversifying into online retail and corporate recycling contracts." },
        { "questionId": "eco-q5", "textValue": "Social procurement opportunities from public sector clients. Partnership with large retailers for stock donations and work placement pathways." },
        { "questionId": "stk-q1", "numericValue": 4 },
        { "questionId": "stk-q2", "numericValue": 3 },
        { "questionId": "stk-q3", "textValue": "Employer partnerships with retail chains for progression pathways. Regular engagement with DSP employment services and local Intreo offices." },
        { "questionId": "stk-q4", "textValue": "Member of ISEN, Charity Retail Association, CRNI, and Disability Federation of Ireland. Active in European Network of Social Integration Enterprises (ENSIE)." },
        { "questionId": "stk-q5", "textValue": "Community donation points across all locations. Schools engagement programme introduces students to social enterprise and circular economy concepts." },
        { "questionId": "sup-q1", "numericValue": 3 },
        { "questionId": "sup-q2", "numericValue": 3 },
        { "questionId": "sup-q3", "textValue": "On-site support coordinators at each location. Employee Assistance Programme available to all staff. Occupational health services and reasonable accommodations." },
        { "questionId": "sup-q4", "textValue": "Referral network with HSE disability services, mental health services, and housing support agencies. Established MOU with ALONE for older person support." },
        { "questionId": "sup-q5", "textValue": "Graduated support model — new employees receive intensive support that reduces over 6 months as competence and confidence grow." },
        { "questionId": "im-q1", "numericValue": 3 },
        { "questionId": "im-q2", "numericValue": 3 },
        { "questionId": "im-q3", "textValue": "Quarterly KPI dashboard tracking: employment outcomes, retail sales per sq ft, waste diversion tonnage, staff satisfaction, and customer feedback scores." },
        { "questionId": "im-q4", "textValue": "Annual impact report published. External evaluation by WRC Social Consultancy every 3 years. Most recent evaluation showed EUR 3.80 social return per EUR 1 invested." },
        { "questionId": "im-q5", "textValue": "Piloting digital outcomes platform to streamline data collection across all sites. Working towards alignment with EU social economy measurement standards." },
        { "questionId": "env-q1", "numericValue": 3 },
        { "questionId": "env-q2", "numericValue": 3 },
        { "questionId": "env-q3", "textValue": "Textile recycling and reuse operations core to environmental mission. 500+ tonnes diverted from landfill annually. Energy audits completed across all retail sites." },
        { "questionId": "env-q4", "textValue": "Green skills training module included in employee induction. Waste segregation and recycling champions designated at each location." },
        { "questionId": "env-q5", "textValue": "Developing a sustainability strategy aligned with Ireland's Climate Action Plan 2024. Solar panel feasibility studies underway for 3 largest sites." }
      ]
    },
    {
      "organisation": {
        "name": "Kilkenny Involvement Network CLG",
        "country": "Ireland",
        "region": "Kilkenny",
        "sector": "Community & Home Care",
        "size": "11-50 employees",
        "legalStructure": "CLG (Company Limited by Guarantee)"
      },
      "responses": [
        { "questionId": "gov-q1", "numericValue": 3 },
        { "questionId": "gov-q2", "numericValue": 4 },
        { "questionId": "gov-q3", "textValue": "Board of 9 directors representing service users, carers, local community, and professional expertise. Monthly board meetings with transparent reporting to members at AGM." },
        { "questionId": "gov-q4", "textValue": "Two service user representatives on the board. Annual members' meeting open to all community stakeholders." },
        { "questionId": "gov-q5", "textValue": "Compliant with CRA Governance Code. Annual external audit. Working towards achieving the Charities Institute Ireland Triple Lock." },
        { "questionId": "sm-q1", "numericValue": 4 },
        { "questionId": "sm-q2", "numericValue": 4 },
        { "questionId": "sm-q3", "textValue": "We support adults with intellectual and physical disabilities to live independently in the Kilkenny community through day services, supported employment, and community participation programmes." },
        { "questionId": "sm-q4", "textValue": "45 participants engaged across day services, supported employment, and community integration programmes. 15 participants in paid employment roles." },
        { "questionId": "sm-q5", "textValue": "Aligned with HSE's New Directions policy, HIQA standards, and the National Framework for Person-Centred Planning in Services for Persons with Disabilities." },
        { "questionId": "emp-q1", "numericValue": 3 },
        { "questionId": "emp-q2", "numericValue": 3 },
        { "questionId": "emp-q3", "textValue": "Supported employment programme places participants with local employers in Kilkenny. Roles include retail assistants, kitchen porters, gardening, and office administration." },
        { "questionId": "emp-q4", "textValue": "15 participants currently in supported employment. Average employment duration is 18 months with 60% retention beyond 2 years." },
        { "questionId": "emp-q5", "textValue": "In-house training in communication skills, workplace readiness, and digital literacy. Partnership with Kilkenny Carlow ETB for accredited training." },
        { "questionId": "cul-q1", "numericValue": 4 },
        { "questionId": "cul-q2", "numericValue": 4 },
        { "questionId": "cul-q3", "textValue": "Person-centred culture with individual support plans for every participant. Trauma-informed approaches in development. Staff trained in Positive Behaviour Support and active support methodology." },
        { "questionId": "cul-q4", "textValue": "Participants choose their daily activities and set their own goals. Regular social events, arts programmes, and community outings are participant-led." },
        { "questionId": "cul-q5", "textValue": "Small team culture with strong peer support. Staff wellbeing programme includes supervision, debriefing sessions, and EAP access." },
        { "questionId": "eco-q1", "numericValue": 2 },
        { "questionId": "eco-q2", "numericValue": 3 },
        { "questionId": "eco-q3", "textValue": "Funding: 75% HSE Section 39, 15% Pobal and local authority grants, 10% fundraising. Very dependent on statutory funding." },
        { "questionId": "eco-q4", "textValue": "Annual budget of EUR 650,000. Reserves of approximately 2 months. Financial planning is year-to-year due to HSE funding uncertainty." },
        { "questionId": "eco-q5", "textValue": "Exploring a social enterprise initiative — community garden produce sales and cafe — to diversify income. Still in planning stage." },
        { "questionId": "stk-q1", "numericValue": 3 },
        { "questionId": "stk-q2", "numericValue": 3 },
        { "questionId": "stk-q3", "textValue": "Partnerships with 8 local employers in Kilkenny. Good relationship with Kilkenny LEADER Partnership and local Chamber of Commerce." },
        { "questionId": "stk-q4", "textValue": "Member of National Federation of Voluntary Service Providers and Disability Federation of Ireland. Participates in Kilkenny Social Enterprise Forum." },
        { "questionId": "stk-q5", "textValue": "Strong community links through the local GAA, Tidy Towns, and parish networks. Participants volunteer in community events." },
        { "questionId": "sup-q1", "numericValue": 3 },
        { "questionId": "sup-q2", "numericValue": 3 },
        { "questionId": "sup-q3", "textValue": "Key worker model with 1:8 ratio. Support covers employment skills, independent living, health, and social participation. Multidisciplinary input from HSE allied health professionals." },
        { "questionId": "sup-q4", "textValue": "Referral partnerships with HSE disability services, Kilkenny mental health services, Focus Housing, and local GP practices." },
        { "questionId": "sup-q5", "textValue": "Developing a peer mentoring programme where experienced participants support newer members of the service." },
        { "questionId": "im-q1", "numericValue": 2 },
        { "questionId": "im-q2", "numericValue": 2 },
        { "questionId": "im-q3", "textValue": "Basic outcomes recorded: attendance, employment starts, and satisfaction surveys. Data entered into spreadsheets. Reporting to HSE quarterly." },
        { "questionId": "im-q4", "textValue": "Annual report to board and HSE. Limited capacity for in-depth impact analysis. No SROI or formal impact evaluation conducted yet." },
        { "questionId": "im-q5", "textValue": "Aware of the need for better impact measurement. Applied for a capacity-building grant to invest in an outcomes management system." },
        { "questionId": "env-q1", "numericValue": 2 },
        { "questionId": "env-q2", "numericValue": 2 },
        { "questionId": "env-q3", "textValue": "Community garden on-site supporting local biodiversity. Recycling and waste segregation in place. No formal environmental policy yet." },
        { "questionId": "env-q4", "textValue": "Gardening and nature-based activities available to participants but not framed as green skills training." },
        { "questionId": "env-q5", "textValue": "Environmental sustainability is on our radar but not yet a strategic priority due to resource constraints." }
      ]
    },
    {
      "organisation": {
        "name": "EVE Holdings CLG",
        "country": "Ireland",
        "region": "Dublin",
        "sector": "Social Care & Health",
        "size": "201-500 employees",
        "legalStructure": "CLG (Company Limited by Guarantee)"
      },
      "responses": [
        { "questionId": "gov-q1", "numericValue": 4 },
        { "questionId": "gov-q2", "numericValue": 4 },
        { "questionId": "gov-q3", "textValue": "Independent board of directors with expertise in disability, healthcare, finance, and governance. Quarterly board meetings, annual strategic review, and published annual reports." },
        { "questionId": "gov-q4", "textValue": "Service user advisory council provides input to strategic planning. Staff representation through Works Council structure." },
        { "questionId": "gov-q5", "textValue": "Full compliance with Charities Regulator governance code. HIQA registered and inspected services. External governance audit conducted 2024." },
        { "questionId": "sm-q1", "numericValue": 5 },
        { "questionId": "sm-q2", "numericValue": 4 },
        { "questionId": "sm-q3", "textValue": "EVE provides rehabilitation, training, and employment support to people recovering from mental health difficulties. Our social firms operate real businesses that provide therapeutic work environments and pathways to mainstream employment." },
        { "questionId": "sm-q4", "textValue": "480 participants across Dublin services. 35% of participants in our social firms transitioned to open employment in 2025. Our cafes serve 800 customers weekly." },
        { "questionId": "sm-q5", "textValue": "Aligned with A Vision for Change (revised), Sharing the Vision mental health policy, and the National Clinical Programme for Early Intervention in Psychosis." },
        { "questionId": "emp-q1", "numericValue": 4 },
        { "questionId": "emp-q2", "numericValue": 4 },
        { "questionId": "emp-q3", "textValue": "Social firms model: participants work in EVE-run cafes, catering, gardens, and enterprise centres earning wages. Graduated progression from therapeutic work to competitive employment." },
        { "questionId": "emp-q4", "textValue": "60 participants employed in social firms at living wage rates. Additional 45 in work placements with external employers. Staff support ratio of 1:6." },
        { "questionId": "emp-q5", "textValue": "FETAC/QQI training in food safety, barista skills, horticulture, and retail. Individual Employment Plans reviewed monthly with dedicated vocational specialists." },
        { "questionId": "cul-q1", "numericValue": 4 },
        { "questionId": "cul-q2", "numericValue": 5 },
        { "questionId": "cul-q3", "textValue": "Recovery-oriented culture embedded across all services. Staff trained in recovery principles, Wellness Recovery Action Planning (WRAP), and motivational interviewing. Stigma-free workplace policies." },
        { "questionId": "cul-q4", "textValue": "Participant-run recovery education programme. Peer support workers employed across all sites. Annual recovery celebration event co-designed by participants." },
        { "questionId": "cul-q5", "textValue": "Wellness at Work programme for all staff. Reflective practice groups. Staff turnover low at 12% — well below sector average." },
        { "questionId": "eco-q1", "numericValue": 3 },
        { "questionId": "eco-q2", "numericValue": 3 },
        { "questionId": "eco-q3", "textValue": "Revenue: 50% HSE funding, 30% social firm trading income (cafes, catering, garden centre), 15% other grants, 5% donations. Trading income growing 12% annually." },
        { "questionId": "eco-q4", "textValue": "3-year financial plan targeting 40% self-generated revenue by 2028. Reserves of 3.5 months. Prudent cost management with annual budgets within 2% variance." },
        { "questionId": "eco-q5", "textValue": "Developing corporate catering contracts and expanding cafe locations. Social procurement opportunities with Dublin City Council and Dun Laoghaire-Rathdown County Council." },
        { "questionId": "stk-q1", "numericValue": 4 },
        { "questionId": "stk-q2", "numericValue": 4 },
        { "questionId": "stk-q3", "textValue": "Partnerships with over 30 employers providing work placements and direct hire pathways. Quarterly employer engagement forums. Close relationship with NRPS (National Rehabilitation Psychiatry Service)." },
        { "questionId": "stk-q4", "textValue": "Member of Mental Health Reform, ISEN, and National Federation of Voluntary Bodies. Active contributor to national mental health policy consultations." },
        { "questionId": "stk-q5", "textValue": "Community cafes serve as neighbourhood social hubs. Open Days programme invites community engagement with our gardens and enterprises." },
        { "questionId": "sup-q1", "numericValue": 4 },
        { "questionId": "sup-q2", "numericValue": 4 },
        { "questionId": "sup-q3", "textValue": "Multidisciplinary teams: occupational therapists, social workers, vocational specialists, peer support workers, and nursing staff. Holistic support covering employment, housing, health, and social inclusion." },
        { "questionId": "sup-q4", "textValue": "Integrated with HSE mental health services. Direct referral pathways with approved centres, community mental health teams, and GP practices across Dublin." },
        { "questionId": "sup-q5", "textValue": "Peer support worker programme employs 8 people with lived experience of mental health recovery as paid support staff, providing hope and practical guidance." },
        { "questionId": "im-q1", "numericValue": 3 },
        { "questionId": "im-q2", "numericValue": 3 },
        { "questionId": "im-q3", "textValue": "Outcomes tracked: employment outcomes, WHODAS disability assessment, recovery measures (RAS-DS), and customer satisfaction in social firms. Quarterly reporting to board and HSE." },
        { "questionId": "im-q4", "textValue": "Annual impact report published. External evaluation by Trinity College Dublin researchers. Social return analysis shows EUR 5.20 return per EUR 1 invested." },
        { "questionId": "im-q5", "textValue": "Implementing outcome star methodology across all services. Contributing data to national mental health outcomes programme." },
        { "questionId": "env-q1", "numericValue": 3 },
        { "questionId": "env-q2", "numericValue": 3 },
        { "questionId": "env-q3", "textValue": "Garden centres and horticultural projects integrate environmental sustainability. Food waste composting across all cafe sites. LED retrofit completed in 4 of 6 locations." },
        { "questionId": "env-q4", "textValue": "Horticulture training includes organic growing, biodiversity, and sustainable food production. Participants maintain community allotments." },
        { "questionId": "env-q5", "textValue": "Developing a formal environmental policy. Green procurement guidelines in draft. Carbon footprint baseline measurement planned for 2027." }
      ]
    },
    {
      "organisation": {
        "name": "Irish Wheelchair Association Employment Services",
        "country": "Ireland",
        "region": "Dublin",
        "sector": "Social Care & Health",
        "size": "51-200 employees",
        "legalStructure": "CLG (Company Limited by Guarantee)"
      },
      "responses": [
        { "questionId": "gov-q1", "numericValue": 4 },
        { "questionId": "gov-q2", "numericValue": 4 },
        { "questionId": "gov-q3", "textValue": "Governed by IWA board with people with physical disabilities forming the majority. Employment services division has its own advisory committee. Transparent annual reporting and CRA compliance." },
        { "questionId": "gov-q4", "textValue": "Service users participate in strategic planning through regional advisory groups. Annual satisfaction survey informs service development." },
        { "questionId": "gov-q5", "textValue": "Full compliance with Charities Governance Code and HIQA National Standards. Regular governance reviews conducted by external consultants." },
        { "questionId": "sm-q1", "numericValue": 4 },
        { "questionId": "sm-q2", "numericValue": 5 },
        { "questionId": "sm-q3", "textValue": "Our mission is to achieve full participation of people with physical disabilities in all aspects of life, with our employment services supporting people to access and maintain meaningful paid employment in the open labour market." },
        { "questionId": "sm-q4", "textValue": "Supporting 200+ jobseekers annually across 12 counties. 38% placement rate into paid employment. Average employment retention of 24 months." },
        { "questionId": "sm-q5", "textValue": "Aligned with UNCRPD Article 27 (Work and Employment), National Disability Inclusion Strategy, and the Pathways to Work Strategy." },
        { "questionId": "emp-q1", "numericValue": 3 },
        { "questionId": "emp-q2", "numericValue": 4 },
        { "questionId": "emp-q3", "textValue": "EmployAbility model: individual assessment, job-matching, employer engagement, and in-work support. We provide ongoing support for as long as needed — there is no arbitrary time limit." },
        { "questionId": "emp-q4", "textValue": "Currently supporting 85 people in employment across diverse sectors: IT, public service, retail, professional services. Employer partners include civil service, tech companies, and retail chains." },
        { "questionId": "emp-q5", "textValue": "Skills training in CV preparation, interview techniques, workplace technology, and self-advocacy. Partnership with AHEAD for graduate supports." },
        { "questionId": "cul-q1", "numericValue": 4 },
        { "questionId": "cul-q2", "numericValue": 4 },
        { "questionId": "cul-q3", "textValue": "Rights-based approach to disability employment. Staff trained in the social model of disability, universal design principles, and assistive technology. Lived experience valued in recruitment." },
        { "questionId": "cul-q4", "textValue": "35% of employment services staff are people with disabilities themselves. Peer mentoring programme pairs jobseekers with successfully employed peers." },
        { "questionId": "cul-q5", "textValue": "Accessible offices throughout with full wheelchair access, hearing loops, and accessible IT. Flexible working arrangements for all staff." },
        { "questionId": "eco-q1", "numericValue": 3 },
        { "questionId": "eco-q2", "numericValue": 3 },
        { "questionId": "eco-q3", "textValue": "Funding: 70% DSP EmployAbility programme, 20% HSE contracts, 10% corporate partnerships and project grants. EmployAbility funding provides core stability." },
        { "questionId": "eco-q4", "textValue": "Financial stability underpinned by multi-year DSP funding agreement. Reserves of 3 months. Annual budget of EUR 2.8 million for employment services." },
        { "questionId": "eco-q5", "textValue": "Developing fee-for-service workplace accessibility audit offering for corporate clients to generate additional unrestricted revenue." },
        { "questionId": "stk-q1", "numericValue": 4 },
        { "questionId": "stk-q2", "numericValue": 4 },
        { "questionId": "stk-q3", "textValue": "Partnerships with over 150 employers nationally. Annual employer awards ceremony recognises inclusive employers. Dedicated employer liaison officers in each region." },
        { "questionId": "stk-q4", "textValue": "Active member of DFI, EASPD, and Open Doors Initiative. Contributing to the AHEAD WAM Programme for graduate employment." },
        { "questionId": "stk-q5", "textValue": "Community engagement through local disability awareness events, schools talks, and participation in National Disability Authority campaigns." },
        { "questionId": "sup-q1", "numericValue": 4 },
        { "questionId": "sup-q2", "numericValue": 3 },
        { "questionId": "sup-q3", "textValue": "Job coaches provide end-to-end support: assessment, job search, placement, and in-work support. Access to IWA's broader services including transport, assisted living, and resource centres." },
        { "questionId": "sup-q4", "textValue": "Referral partnerships with HSE, local authorities, housing agencies, and Access Consultants network. Integrated with IWA's national service network." },
        { "questionId": "sup-q5", "textValue": "Assistive technology assessment and provision. Workplace accommodation advisory service helps employers make reasonable adjustments." },
        { "questionId": "im-q1", "numericValue": 3 },
        { "questionId": "im-q2", "numericValue": 3 },
        { "questionId": "im-q3", "textValue": "Employment outcomes, placement retention rates, employer satisfaction, and participant quality of life surveys tracked quarterly. Data reported to DSP and board." },
        { "questionId": "im-q4", "textValue": "Annual outcomes report shared with stakeholders. Participated in DSP programme evaluation 2024 which rated our service 'highly effective'." },
        { "questionId": "im-q5", "textValue": "Exploring longitudinal tracking of employment outcomes over 5+ years to demonstrate sustained impact." },
        { "questionId": "env-q1", "numericValue": 2 },
        { "questionId": "env-q2", "numericValue": 2 },
        { "questionId": "env-q3", "textValue": "Reducing paper use through digital systems. Video conferencing reducing travel-related emissions for rural service delivery." },
        { "questionId": "env-q4", "textValue": "Environmental sustainability not yet a core focus area. Some ad-hoc green initiatives at individual offices." },
        { "questionId": "env-q5", "textValue": "Recognise the need for a more structured approach to environmental sustainability. Will be included in next strategic plan 2027-2030." }
      ]
    },
    {
      "organisation": {
        "name": "Galway Simon Community",
        "country": "Ireland",
        "region": "Galway",
        "sector": "Food & Hospitality",
        "size": "11-50 employees",
        "legalStructure": "CLG (Company Limited by Guarantee)"
      },
      "responses": [
        { "questionId": "gov-q1", "numericValue": 3 },
        { "questionId": "gov-q2", "numericValue": 4 },
        { "questionId": "gov-q3", "textValue": "Volunteer board of 10 directors with skills in social work, finance, housing, and enterprise. Quarterly meetings with published minutes. Annual governance statement in line with CRA Governance Code." },
        { "questionId": "gov-q4", "textValue": "Residents' committee provides input to service development. Former service users sit on the enterprise advisory committee." },
        { "questionId": "gov-q5", "textValue": "Governance Code compliant. Annual external audit. Working towards Charities Institute Ireland Standards." },
        { "questionId": "sm-q1", "numericValue": 4 },
        { "questionId": "sm-q2", "numericValue": 4 },
        { "questionId": "sm-q3", "textValue": "Our social enterprise cafe and catering service provides supported employment and training for people experiencing homelessness and housing instability. We see food as a vehicle for building skills, confidence, and community connections." },
        { "questionId": "sm-q4", "textValue": "25 participants in our catering and cafe training programme annually. 55% progress to mainstream hospitality employment within 12 months of completing our programme." },
        { "questionId": "sm-q5", "textValue": "Aligned with Housing First principles, National Homelessness Action Plan, and Ireland's National Social Enterprise Policy commitment to labour market activation." },
        { "questionId": "emp-q1", "numericValue": 3 },
        { "questionId": "emp-q2", "numericValue": 3 },
        { "questionId": "emp-q3", "textValue": "12-week structured programme: food safety training, kitchen skills, front-of-house experience, and work placement with local restaurants and hotels. Participants earn a training allowance." },
        { "questionId": "emp-q4", "textValue": "Currently 12 participants in cafe-based training. 6 in external work placements with partner businesses including Galway Bay Hotel and Kai Restaurant." },
        { "questionId": "emp-q5", "textValue": "HACCP Level 1 and Level 2 certification, Food Safety Authority of Ireland training, and barista skills certification offered to all participants." },
        { "questionId": "cul-q1", "numericValue": 4 },
        { "questionId": "cul-q2", "numericValue": 4 },
        { "questionId": "cul-q3", "textValue": "Trauma-informed approach embedded across all programmes. Low-threshold, compassionate culture. Staff trained in motivational interviewing, harm reduction, and psychologically informed environments." },
        { "questionId": "cul-q4", "textValue": "Participants co-design weekly menus and contribute recipes. Monthly team meetings include participants and staff equally. No uniforms — emphasis on dignity and normalisation." },
        { "questionId": "cul-q5", "textValue": "Flexible attendance policy accommodates the chaotic lives of people experiencing homelessness. Re-engagement is always welcome — no penalties for absence." },
        { "questionId": "eco-q1", "numericValue": 2 },
        { "questionId": "eco-q2", "numericValue": 3 },
        { "questionId": "eco-q3", "textValue": "Revenue: 40% cafe trading income, 35% HSE and Pobal grants, 15% fundraising and donations, 10% catering contracts. Cafe has been profitable for 2 consecutive years." },
        { "questionId": "eco-q4", "textValue": "Small reserves (6 weeks). Working to grow catering contract income. Budget of EUR 420,000 annually." },
        { "questionId": "eco-q5", "textValue": "Exploring corporate catering contracts with Galway-based tech companies (Medtronic, SAP). Developing an events catering service." },
        { "questionId": "stk-q1", "numericValue": 3 },
        { "questionId": "stk-q2", "numericValue": 3 },
        { "questionId": "stk-q3", "textValue": "Partnerships with 6 local hospitality employers for work placements. Galway City Council supports our enterprise through community grants and procurement." },
        { "questionId": "stk-q4", "textValue": "Member of Simon Communities of Ireland, ISEN, and Restaurants Association of Ireland. Active in Galway Food Trail network." },
        { "questionId": "stk-q5", "textValue": "Cafe is a valued community space in the city centre — known for quality food and social purpose. Regular community events and charity coffee mornings." },
        { "questionId": "sup-q1", "numericValue": 3 },
        { "questionId": "sup-q2", "numericValue": 4 },
        { "questionId": "sup-q3", "textValue": "Key workers provide 1:1 support covering housing, health, addiction, and employment. Weekly group support sessions. Access to Simon Community's broader housing and outreach services." },
        { "questionId": "sup-q4", "textValue": "Integrated with Simon Community's homelessness services. Referral pathways with Western Region Drug and Alcohol Task Force, HSE addiction services, and Galway City Partnership." },
        { "questionId": "sup-q5", "textValue": "Peer mentoring programme — 3 former participants now employed as peer support workers, providing lived experience guidance to current participants." },
        { "questionId": "im-q1", "numericValue": 2 },
        { "questionId": "im-q2", "numericValue": 3 },
        { "questionId": "im-q3", "textValue": "Track: programme completion rates, employment outcomes, housing stability, and participant wellbeing using Outcomes Star (Homelessness). Quarterly reporting." },
        { "questionId": "im-q4", "textValue": "Annual report shared with board and funders. Limited capacity for independent evaluation. Rely on funder evaluations for external validation." },
        { "questionId": "im-q5", "textValue": "Would like to conduct SROI analysis but lack capacity. Applying for research partnership with NUI Galway to evaluate long-term outcomes." },
        { "questionId": "env-q1", "numericValue": 3 },
        { "questionId": "env-q2", "numericValue": 3 },
        { "questionId": "env-q3", "textValue": "Food waste minimisation is central — we partner with FoodCloud for surplus food redistribution. Composting system for cafe food waste. Seasonal, locally-sourced menu reduces food miles." },
        { "questionId": "env-q4", "textValue": "Sustainable food practices integrated into training — participants learn about seasonal cooking, food waste reduction, and sustainable sourcing." },
        { "questionId": "env-q5", "textValue": "Working towards becoming a certified Green Restaurant. Reusable cup programme and elimination of single-use plastics in the cafe." }
      ]
    },
    {
      "organisation": {
        "name": "Baboró International Arts Festival CLG",
        "country": "Ireland",
        "region": "Galway",
        "sector": "Other",
        "size": "1-10 employees",
        "legalStructure": "CLG (Company Limited by Guarantee)"
      },
      "responses": [
        { "questionId": "gov-q1", "numericValue": 3 },
        { "questionId": "gov-q2", "numericValue": 3 },
        { "questionId": "gov-q3", "textValue": "Small voluntary board with expertise in arts, education, and community development. Board meets 6 times per year. Annual report and accounts filed with CRA and CRO." },
        { "questionId": "gov-q4", "textValue": "Young people's advisory panel provides input to programming. Community partners consulted in strategic planning." },
        { "questionId": "gov-q5", "textValue": "Governance Code compliant. Small board means each director takes active governance responsibilities." },
        { "questionId": "sm-q1", "numericValue": 4 },
        { "questionId": "sm-q2", "numericValue": 4 },
        { "questionId": "sm-q3", "textValue": "We use arts and creativity as pathways to employment and social inclusion for young people facing disadvantage. Our Creative Employment Programme combines arts training with workplace skills development." },
        { "questionId": "sm-q4", "textValue": "18 young people complete our annual Creative Employment Programme. 70% progress to employment, further education, or apprenticeships within 6 months." },
        { "questionId": "sm-q5", "textValue": "Aligned with Creative Ireland Programme 2023-2027, National Youth Strategy, and EU Creative Europe priorities for access and inclusion." },
        { "questionId": "emp-q1", "numericValue": 3 },
        { "questionId": "emp-q2", "numericValue": 3 },
        { "questionId": "emp-q3", "textValue": "6-month Creative Employment Programme: arts workshops, digital skills, event management experience, and work placements with cultural organisations. Participants receive a training allowance." },
        { "questionId": "emp-q4", "textValue": "8 participants currently in programme. Work placements with Druid Theatre, Town Hall Theatre, and local creative businesses." },
        { "questionId": "emp-q5", "textValue": "QQI Level 4 in Arts and Media, digital skills certifications, and event management training. Portfolios developed for each participant." },
        { "questionId": "cul-q1", "numericValue": 4 },
        { "questionId": "cul-q2", "numericValue": 4 },
        { "questionId": "cul-q3", "textValue": "Creative, expressive, youth-centred culture. Participants encouraged to take creative risks in a safe environment. Emphasis on self-expression, confidence building, and finding your voice." },
        { "questionId": "cul-q4", "textValue": "Participants curate their own exhibition as part of the programme. Young people MC events and present their work publicly." },
        { "questionId": "cul-q5", "textValue": "Small team — very collaborative and non-hierarchical. Staff are practising artists who model creative professional life." },
        { "questionId": "eco-q1", "numericValue": 2 },
        { "questionId": "eco-q2", "numericValue": 2 },
        { "questionId": "eco-q3", "textValue": "Funding: 50% Arts Council, 25% Galway City Council, 15% project grants (Pobal, Dormant Accounts), 10% earned income from festival ticket sales. Very grant-dependent." },
        { "questionId": "eco-q4", "textValue": "Annual budget EUR 280,000. Reserves of approximately 6 weeks. Year-to-year funding makes long-term planning difficult." },
        { "questionId": "eco-q5", "textValue": "Exploring corporate sponsorship and creative industry partnerships. Limited capacity for commercial diversification given small team." },
        { "questionId": "stk-q1", "numericValue": 3 },
        { "questionId": "stk-q2", "numericValue": 3 },
        { "questionId": "stk-q3", "textValue": "Partnerships with 5 cultural organisations for work placements. Relationship with Galway City Partnership Youth Employability programme." },
        { "questionId": "stk-q4", "textValue": "Member of ISEN, Theatre Forum, and Young People at Risk network. Connected to Creative Europe networks." },
        { "questionId": "stk-q5", "textValue": "Public performances and exhibitions bring programme participants into community life. Strong relationships with local schools and youth services." },
        { "questionId": "sup-q1", "numericValue": 2 },
        { "questionId": "sup-q2", "numericValue": 3 },
        { "questionId": "sup-q3", "textValue": "Programme coordinator provides individual support. External youth worker facilitates group sessions. Referrals to Jigsaw Galway for mental health support when needed." },
        { "questionId": "sup-q4", "textValue": "Referral partnerships with Galway Roscommon ETB, Jigsaw youth mental health, and local youth services." },
        { "questionId": "sup-q5", "textValue": "Limited capacity for wraparound support — rely on partnerships. Would benefit from a dedicated support worker." },
        { "questionId": "im-q1", "numericValue": 2 },
        { "questionId": "im-q2", "numericValue": 2 },
        { "questionId": "im-q3", "textValue": "Track programme completion, employment outcomes, and participant feedback through post-programme surveys. Basic data collection." },
        { "questionId": "im-q4", "textValue": "Annual report to funders. Participant testimonials collected. No formal impact evaluation methodology in place." },
        { "questionId": "im-q5", "textValue": "Keen to develop better impact measurement but limited by staff capacity. Would value sector-level support or mentoring on this." },
        { "questionId": "env-q1", "numericValue": 2 },
        { "questionId": "env-q2", "numericValue": 2 },
        { "questionId": "env-q3", "textValue": "Festival events use sustainable materials where possible. Digital programmes reduce paper. Partner venues have their own environmental policies." },
        { "questionId": "env-q4", "textValue": "Some environmental themes in creative workshops but not a systematic approach to green skills." },
        { "questionId": "env-q5", "textValue": "Environmental sustainability not currently a strategic priority but open to developing this area." }
      ]
    },
    {
      "organisation": {
        "name": "Speedpak Group",
        "country": "Ireland",
        "region": "Dublin",
        "sector": "Construction & Trades",
        "size": "51-200 employees",
        "legalStructure": "CLG (Company Limited by Guarantee)"
      },
      "responses": [
        { "questionId": "gov-q1", "numericValue": 3 },
        { "questionId": "gov-q2", "numericValue": 4 },
        { "questionId": "gov-q3", "textValue": "Board of directors with backgrounds in social enterprise, construction, and community development. Meetings every 6 weeks. Accounts filed annually with CRO and CRA." },
        { "questionId": "gov-q4", "textValue": "Staff representatives attend board meetings quarterly. Participant feedback collected through annual surveys and exit interviews." },
        { "questionId": "gov-q5", "textValue": "CRA Governance Code compliant. Annual independent audit by Grant Thornton." },
        { "questionId": "sm-q1", "numericValue": 4 },
        { "questionId": "sm-q2", "numericValue": 4 },
        { "questionId": "sm-q3", "textValue": "Speedpak provides work integration through packaging, assembly, and light manufacturing services. We employ people who are long-term unemployed, giving them real work experience, skills, and a pathway back to the labour market." },
        { "questionId": "sm-q4", "textValue": "85 participants annually across our packaging, assembly, and maintenance divisions. 48% secure mainstream employment within 12 months of completing our programme." },
        { "questionId": "sm-q5", "textValue": "Operating under Ireland's National Social Enterprise Policy and Community Employment scheme frameworks. Aligned with DEASP activation strategies." },
        { "questionId": "emp-q1", "numericValue": 3 },
        { "questionId": "emp-q2", "numericValue": 4 },
        { "questionId": "emp-q3", "textValue": "Participants work in real commercial operations: packaging, labelling, assembly, and facility maintenance contracts. Skills transfer directly to mainstream employment. 12-month structured programme." },
        { "questionId": "emp-q4", "textValue": "Currently 65 participants working across packaging, assembly, and maintenance. Competitive commercial contracts with pharmaceutical and FMCG companies." },
        { "questionId": "emp-q5", "textValue": "QQI certifications in logistics, warehousing, manual handling, and forklift operation. Health and safety certifications (SafePass, Working at Heights)." },
        { "questionId": "cul-q1", "numericValue": 3 },
        { "questionId": "cul-q2", "numericValue": 4 },
        { "questionId": "cul-q3", "textValue": "Practical, workplace-focused culture. Emphasis on punctuality, teamwork, and professional standards — reflecting the expectations participants will encounter in mainstream employment." },
        { "questionId": "cul-q4", "textValue": "Monthly team meetings, staff social events, and recognition of achievements. Employee of the Month programme. Safety committee includes participant representatives." },
        { "questionId": "cul-q5", "textValue": "On-site canteen and rest areas. Access to occupational health nurse. Flexible scheduling for medical appointments and family commitments." },
        { "questionId": "eco-q1", "numericValue": 3 },
        { "questionId": "eco-q2", "numericValue": 4 },
        { "questionId": "eco-q3", "textValue": "Revenue: 60% commercial contracts (packaging, assembly), 30% CE scheme funding, 10% facility management contracts. Commercial revenue provides strong earned income base." },
        { "questionId": "eco-q4", "textValue": "Financially stable with reserves of 5 months. Commercial operations consistently profitable. Annual turnover of EUR 3.2 million." },
        { "questionId": "eco-q5", "textValue": "Growing facility management contracts. Exploring expansion into e-commerce fulfilment services. Long-term client relationships with major brands." },
        { "questionId": "stk-q1", "numericValue": 3 },
        { "questionId": "stk-q2", "numericValue": 3 },
        { "questionId": "stk-q3", "textValue": "Commercial client relationships provide employment pathways — some clients directly hire our participants. Partnership with local Intreo offices for referrals." },
        { "questionId": "stk-q4", "textValue": "Member of ISEN and Social Enterprise sector groups. Active in north Dublin community through Northside Partnership." },
        { "questionId": "stk-q5", "textValue": "Community engagement through Northside Partnership networks. Open day events for local community and referral agencies." },
        { "questionId": "sup-q1", "numericValue": 3 },
        { "questionId": "sup-q2", "numericValue": 3 },
        { "questionId": "sup-q3", "textValue": "On-site supervisor support with dedicated participant development officers. Access to ETB literacy and numeracy support. Referrals to addiction and mental health services as needed." },
        { "questionId": "sup-q4", "textValue": "Referral network with DEASP/Intreo, ETBs, and local community development organisations. Partnership with Ballymun Job Centre." },
        { "questionId": "sup-q5", "textValue": "Structured exit planning begins at month 9 — CV development, interview preparation, and employer introductions." },
        { "questionId": "im-q1", "numericValue": 2 },
        { "questionId": "im-q2", "numericValue": 3 },
        { "questionId": "im-q3", "textValue": "Track: employment outcomes, contract quality metrics, attendance, and skills progression. Quarterly data reported to CE sponsors and board." },
        { "questionId": "im-q4", "textValue": "Annual report produced. CE scheme reporting requirements met. Limited independent evaluation — rely on programme-level data." },
        { "questionId": "im-q5", "textValue": "Recognise need for more sophisticated impact measurement. Exploring digital systems to replace spreadsheet-based tracking." },
        { "questionId": "env-q1", "numericValue": 2 },
        { "questionId": "env-q2", "numericValue": 3 },
        { "questionId": "env-q3", "textValue": "Waste segregation and recycling across all operations. Packaging materials sourced sustainably where possible. Energy-efficient lighting installed." },
        { "questionId": "env-q4", "textValue": "Environmental awareness included in health and safety induction. Participants learn waste management and recycling practices." },
        { "questionId": "env-q5", "textValue": "Developing a sustainability action plan. Investigating solar panels for the main facility. Environmental policy in draft." }
      ]
    }
  ]
}
